Revit 2017 API
ReinforcementSettings.NumberVaryingLengthRebarsIndividually Property
 Use this option to modify the way varying length bars are numbered (individually or as a whole).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public bool NumberVaryingLengthRebarsIndividually { get; set; }
Visual Basic
Public Property NumberVaryingLengthRebarsIndividually As Boolean
	Get
	Set
Visual C++
public:
property bool NumberVaryingLengthRebarsIndividually {
	bool get ();
	void set (bool value);
}
Remarks
 If the property is :
True, then each bar in a varying rebar set will be assigned a rebar number.
False, the whole rebar set will be assigned a unique rebar number and each bar within the set will be assigend a suffix (unique within the set).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace